
• 차원이 늘어날 수록(=변수가 늘어날 수록) 각 변수에 대한 정보가 기하급수적으로 증가하게 됨
• 반대로 전체의 관점에서 보면, 차원이 늘어날수록 20%에 해당하는 부분이(=전체 대표값이) 각 변수의 값을 포함하는 부분이 적어짐. 대표값이 각 값을 대변하지 못함
• 오버피팅; overfitting(너무 적을 때) & 언더피팅(너무 많을 때) --> 변수는 너무 많아도, 너무 적어도 안좋아. 적당히 있어야~적당히~
• SEMMA; Sample, Explore, Modify, Model, Assess. SAS에서 만든 방법론 --> 제일 중요한건 Explore
• EDA; Exploratory Data Analysis. 탐색적 자료 분석. 데이터가 가진 정보를 데이터의 탐색만으로 얻는 방법. 다양한 시도를 해야함. 분석의 첫 단계.데이터의 패턴/규칙을 파악할 수 있음

• 자료의 분류
	• 수치형변수numerical variable
		○ 연속형변수continous: 자세하게 하자면 계속 늘어날 수 있어
		○ 이산형변수discrete: 똑딱 떨어짐. 1.5명 없으니까
	• 범주형변수categorical
		○ 명목형nominal: 혈액형 성별
		○ 순위형ordinal: 학년, 등급, 설문지 척도
• 범주형자료의 요약. 파레토그림(막대그래프의 일종. 상대도수이 크기가 큰 순서대로 범주를 왼쪽부터 오른쪽으로 배열)

• 통계를 해야하는 이유. 통계는 해석의 학문. 데이터의 패턴을 파악하지 못한다면 걍 더미일뿐
• EDA는 결국 모의시험. 여러가지 방법론을 돌려보고 어떤 방법론을 활용하면 유의미한 결과를 도출할 수 있을지 찾아보는 것--> explore
• 예측하다: Prediction and forecasting 둘은 달라
• 과거에도 이랬으니까 패턴이 반복된다면 미래에도 이렇게 될거야 --> prediction. 통계를 기반으로 한 의사결정
• Data, prediction, sampling, 
• 빅데이터 중에서 어떻게 샘플링할 것인가.
• 왜 지금 데이터분석이 더 각광받을까. 기술의 발전으로 더 쉽고 빠르게, 이쁘게 할 수 있게 된 것. 기술발달로 접근성이 늘어났고 활용하려는 움직임이 생긴 것. 금광 캐는 도구가 곡괭이에서 포크래인으로 바뀌면서 금맥 찾고 금광 캐는 거에 사람들이 더 열광하게 된 것이라 보면 될까...?
• 기술이 달라진 게 아니라 관련된 환경과 인식이 달라진 것. 분석해도 의사결자가 받아들이지 않으면 의미 없지. 이제는 그 분석 자체를 과학적으로 신뢰하는 분위기가 형성된 것

• 연속형자료의 요약: 점도표(일직선 위에 표시. 너무 많은 자료는 안돼), 도수분포표(계급구간 class interval을 표시해서 그 안에 포함 된 걸 카운팅. 폭을 어떻게 설정하느냐에 따라 달라짐), 히스토그램(데이터값의 범위, 빈도의 집중영역을 알 수 있음), 줄기-잎그림
• 분산과 표준편차
	• 편차deviation: 관측값-평균
	• 표본 분산sample variance: (편차 제곱합)/(n-1)
		○ (n-1)은 자유도가 아니라고.....?
	• 표본 표준편차: 표본분산의 양의 제곱근. 단위 맞춰주려고 표준편차를 사용함
• 상자그림
	• 사분위수: Q1, Q2, Q3
	• IQR=Q3-Q1
	• Boxplot은 두 그룹을 비교하는데 유용
• X: 설명변수, 독립변수. 영향을 주는 변수
• 영향을 받는 변수: y, 
• Y, X, 적합한 표현=
• (연속형 연속형 산점도), (범주형범주형모자이크플랏), (범주형 연속형 박스플랏)
• 상관계수
	• 직선관계만 알려줌. 그림과 계수를 함께 관찰해야함
	• 상관계수 값이 항상 두 변수 사이의 인과관계를 의미하진 않음
	• 인과관계는 다른 조건은 모두 같고 특정 변수만 다를 때 그 변수에 대해 인과관계를 추정할 수 있음
